import React from "react";

export default function School() {
  const school = [
    `أول أطروحة استخدمت الحاسوب في دراسة اللغة العربية، في الرسالة التي حصلت بها على الماجستير 1974.`,
    ` حرصت على تشجيع المتفوقين في الدراسات اللغوية: فقد خصصت مبلغا ماليا كبيرا  من عام 2004 وديعة يصرف عائدها السنوي للطلبة المتفوقين في فروع علم اللغة بآداب القاهرة.`,
    `ربطت ثلاثين باحثا بأحدث المراجع الأجنبية، حين وفرت لهم اشتراكات سنوية في مكتبة الجامعة الأمريكية.`,
    ` دربت الباحثين عمليا على العمل الجماعي، حين كونت فريق عمل من 20 باحثا شاركوها في جـمع مادة (معـجـم التعـابير الاصـطـلاحـية في العـربية المعـاصرة)، وكافأتهم بإعطائهم مقابلا ماديا من مالها الخاص.`,
    `أشرفت على 62 أطروحة علمية بالجامعات المصرية، واشتركت في مناقشة 33 أطروحة للماجستير والدكتوراه.`,
  ];
  return (
    <div className="p-2">
      <h2 className="font-bold text-3xl text-[#235A93]  mb-5 ">
        {" "}
        المدرسة العلمية
      </h2>
      <div className="space-y-3">
        {school.map((item, index) => (
          <p className="font-bold" key={index}>
            <i
              className={`fa-solid fa-${
                index + 1
              } text-[#235A93] ml-1 font-bold`}
            >
              .
            </i>
            {item}
          </p>
        ))}
      </div>
      <p className="h-[1px] w-1/3 mx-auto bg-slate-300 my-10"></p>
    </div>
  );
}
