import { title } from "process";
import React from "react";

export default function Shares() {
  const data = [
    {
      title: `( المعجم العربي الأساسي للناطقين بالعربية ومتعلميها: دراسة نقدية)- جزء من متطلبات الحصول على درجة الماجستير – كلية الدراسات العليا – جامعة الكويت.`,
    },
    {
      title: `تحكيم خارجي لأطروحة ( الكمية في الأصوات الصائتة في اللغة العربية) ، المقدمة لنيل درجة الدكتوراه من جامعة علي قار الإسلامية بالهند.`,
    },
    {
      title: `تحكيم ثلاث أطروحات للحصول على درجة الماجستير، من كلية الدراسات العليا، جامعة الكويت.`,
    },
    {
      title: `تحكـيم كتاب (جماليات الأدب العربي: قراءات ونصوص أدبية ): لجنة التأليف والتعـريب والنـشـر، مجلس النشر العـلمي جامعة الكويت.`,
    },
    {
      title: `مراجعة ترجمة (المعاجم عبر الثقافات: دراسات في المعجمية): مجلس النشر العلمي- جامعة الكويت.`,
    },
    {
      title: `مراجعة ترجمة كتاب: ( الترجمة والمعنى: دليل التكافؤ عبر اللغات) تأليف ملدريد لارسون- لجنة التأليف والتعريب والنشر- مجلس النشر العلمي- جامعة الكويت.`,
    },
    {
      title: `تقييم الإنتاج المقدم  للترقية إلى درجات أستاذ، وأستاذ مشارك، وأستاذ مساعد من: `,
      sub: [
        "كلية اللغات الأجنبية- جامعة شنجهاي الوطنية- تايبيه، تايوان: باحثة واحدة (1).",
        "كلية معارف الوحي الإسلامي والعلوم الإنسانية- الجامعة الإسلامية العالمية بماليزيا: باحثان (2).",
        "كليتي الآداب والتربية- وابن رشد بجامعة بغداد: باحثان(2)- كلية الآداب بجامعة الكويت: أربعة باحثين (4)",
        " مركز اللغات والترجمة بأكاديمية الفنون بمصر: ثلاثة باحثين(3)، والجامعات المصرية: اثنا عشر باحثا (12).",
        "كـلـية الآداب والعـلـوم الإنـسانـيـة- جامعة الملك عبد العزيز- جدة : ثلاثة باحثين (3).",
        "كلية الملك خالد العسكرية بالمملكة (1)، جامعة الأقصى بفلسطين (2)، كلية التربية بجامعة تعـز باليمن (1).",
      ],
    },
    {
      title:
        "تحكيم بحوث للنشر في عدد من المؤتمرات المنعقدة بالدول العربية، وفي عدد من الدوريات العلمية المحكمة، بالسعودية والكويت، والإمارات العربية، والأردن، وعدد (6) ست مجلات علمية في مصر.",
    },
  ];
  return (
    <div className="p-2">
      <h2 className="font-bold text-3xl text-[#235A93] mb-5">
        {" "}
        الاشتراك في التحكيم وتقييم الإنتاج العلمي
      </h2>
      <div className="space-y-3">
        {data.map((item, index) => (
          <p className="font-bold" key={index}>
            <i
              className={`fa-solid fa-${
                index + 1
              } text-[#235A93] ml-1 font-bold`}
            >
              .
            </i>
            {item.title}
            {item.sub && (
              <ul className="mt-2 space-y-1 pr-5">
                {item.sub.map((subItem, subIndex) => (
                  <li
                    key={subIndex}
                    className="font-normal list-disc list-inside"
                  >
                    {subItem}
                  </li>
                ))}
              </ul>
            )}
          </p>
        ))}
      </div>
      <p className="h-[1px] w-1/3 mx-auto bg-slate-300 my-10"></p>
    </div>
  );
}
