import React from "react";

export default function Volenteering() {
  const school = [
    `قادت حملة علمية وإعلامية لتصحيح التعريف المسيء والمشوه لصورة (العربي)، الذي ورد في معجم Merriam Webster's Collegiate Dictionary عام 2005، وخاطبت مؤسسة وبستر بالأدلة العلمية، ونتج عن جهود الحملة أن صححت المؤسسة هذا التعريف في المعاجم الالكترونية.`,
    `تطوعت مع عدد من الأهل والأصدقاء، بدءا من 2007 ، بإنشاء مدرسة لتعليم الأطفال بمستشفى 57357 داخل المستشفى، وتقديم ما يلزم العملية التعليمية لهم من المرحلة الابتدائية حتى نهاية الثانوية، دون مقابل.`,
    `تطوعت بإعادة الوجه الجمالي لحديقة مجمع بالقاهرة، فأشرفت على إحيائها، وزراعتها على نفقتها الخاصة.`,
    `رئيسة قسم اللغة العربية بكليتي الآداب للبنات والتربية لإعداد المعلمات بالرياض1982- 1984، 1993- 1994.`,
    `رئيسة قسم النحو والصرف والعروض، كلية دار العلوم، جامعة القاهرة، فرع الفيوم 1997- 1999.`,
    `عضو مراسل في مجمع اللغة العربية بدمشق، بدءا من عام 2002.`,
    `عضو لجنة تحكيم جوائز اتحاد الكتاب بمصر في الأعوام من 2006- 2008 ، وأيضا في عام 2021.`,
    `عضو اللجنة العلمية، ورئيسة اللجنة الفرعية للغة العربية، بملتقى مترجمي النصوص الإسلامية بالرياض، من  2015 إلى 2019.`,
    `مقررة لجان: اللغة العربية في الإعلام، واللهجات والبحوث اللغوية، وتنسيق المعجم الكبير، بمجمع اللغة العربية بالقاهرة.`,
    `عضو بلجان: اللغة العربية والذكاء الاصطناعي، والمعجم الكبير، والمكتبة وعلوم المكتبات، بمجمع اللغة بالقاهرة.`,
    `مستشار لغوي سابق لشركة مايكروسوفت  Cairo Microsoft Innovation Center.`,
    `عضو الهيئة العلمية للجمعية المصرية لهندسة اللغة.`,
    `عضو مراسل بمجمع اللغة العربية بدمشق.  من ( 2002- حتى الآن ).`,
    `عضو اللجنة العلمية لمركز تحقيق التراث- القاهرة ، في الأعوام من: 2008- 2013.`,
    `عضو المجالس القومية المتخصصة، شعبة الأدب واللغة، في الأعوام من (1998- 2011).`,
    `عضو المجلس القومي للثقافة والفنون والآداب والإعلام ، في الأعوام من (2002- 2011).`,
    `عضو لجنة الثقافة بالمجلس القومي للمرأة ، في الأعوام من (2006- 2009).`,
    `عضو مجلس إدارة الجمعية الدولية لمترجمي العربية (جمع ATI) Atinternational.org.`,
    ,
    `عضو مجلس إدارة مركز جامعة القاهرة للغة والثقافة العربية ، في الأعوام من 2013-2018.`,
  ];
  return (
    <div className="p-2">
      <h2 className="font-bold text-3xl text-[#235A93]  mb-5 ">
        {" "}
        الإسهامات والأنشطة العامة والعلمية والمجمعية
      </h2>
      <div className="space-y-3">
        {school.map((item, index) => (
          <p className="font-bold" key={index}>
            <span className="text-[#235A93] ml-2 font-extrabold">.</span>
            {item}
          </p>
        ))}
      </div>
      <p className="h-[1px] w-1/3 mx-auto bg-slate-300 my-10"></p>
    </div>
  );
}
