import React from "react";

const researches = [
  `(تطور ظاهرة تغريب الأسماء التجارية بالشارع المصري: دراسة مقارنة على  القاهرة الكبرى). مجلة الدراسات الشرقية، جامعة القاهرة ـ العدد السابع 1988.`,
  ` (ظاهرة تغريب الأسماء التجارية بالشارع المصري: دراسة مسحية على القاهرة  الكبرى). حولية كلية الإنسانيات والعلوم الاجتماعية، جامعة قطر، العدد 12، 1989.`,
  `(مدى ارتباط الفعل الثلاثي الصحيح بالمضارع المفتوح العين: دراسة إحصائية على القاموس المحيط). مجلة آداب القاهرة، العدد 58 مارس 1993.`,
  `(البنيوية في اللسانيات): عالم الفكر، المجلد 26. العدد الثاني: 1997- المجلس الوطني للثقافة والفنون والآداب ـ الكويت.`,
  `(عين الخليل في الأندلس): المؤتمر الدولي الرابع للحضارة الأندلسية- جامعة القاهرة ، مارس 1998.`,
  `(بعض مظاهر تغير الصيغ الصرفية في العربية المعاصرة): الندوة الدولية للمعاجم اللغوية والمختصة، جامعة الكويت ـ 1999.`,
  `)تحرير بعض مداخل (موسوعة أعلام العلماء العرب والمسلمين): المنظمة العربية للتربية والثقافة والعلوم.`,
  `(الأفعال المضعفة وأبوابها الصرفية): المجلة العربية للعلوم الإنسانية- ج الكويت– ع 74- ربيع 2001.`,
  `(ظاهرة تغريب الأسماء التجارية بالشارع المصري: دراسة مسحية على القاهرة الكبرى عام 1993). مجلة آداب القاهرة2001.`,
  `(الباب الصرفي للفعل المضعف وأحياز أصواته: دراسة في الأحياز الوسطية والذلقية) ثمرات الامتنان، الخانجي، القاهرة 2002.`,
  `(مجامع اللغة العربية ) – مجلة مجمع اللغة العربية بالقاهرة - العدد 97 - 2002.`,
  `(مواجهة التغريب في اللغة والثقافة) 2/2/2002.`,
  `(دور اللغة والأدب في تحديث المجتمع) 18/6 /2002.`,
  ` ( اللغة والشعر ) : 18 /6 /2002.`,
  `(التلوث اللغوي) : 3 /6 /2003.`,
  `( أدب الطفل ) : 6 /12 /2003 .`,
  ` ( تعريب لغة التعليم العالي) : 18/5/2004`,
  `(الأدب ودوره في التلاقي العربي): 6/11/2004.`,
  `(اللغة والثقافة بين العوربة والعولمة): 31/12/2005.`,
  `(بعض صور التعبيرات الاصطلاحية في العربية المعاصرة)– مجلة مجمع اللغة العربية بدمشق – المجلد 78- ج 4 2003.`,
  `مقدمة كتاب ( جواهر الألفاظ )– سلسلة الذخائر رقم 110- الهيئة العامة لقصور الثقافة – القاهرة – ديسمبر2003.`,
  `(معـالجة المعـاجم اللغـوية العـربية العـامة للتجمعـات اللفـظـية): الدورة لتدريبية وورشة العمل الأولى: (التفكير العلمي وتاريخ العلوم) - ج القاهرة/ ليل1 فرنسا، يناير 2004.`,
  `(البحث المعجمي في مصر منذ منتصف القرن العشرين): مؤتمر (واقع الدراسات اللغوية في مصر)، ك. آداب القاهرة 2004.`,
  `(جهود الدكتور حسين نصار في الدراسات المعجمية)- مجلة تراثيات– دار الكتب والوثائق القومية – القاهرة 2004.`,
  `(بين أزمة التعريب وهجمة التغريب): بحوث كتاب (في التعريب والتغريب) - مركز الأهرام للترجمة والنشر- ط1 – 2005.`,
  `(ظاهرة تغريب الأسماء التجارية في بعض عواصم المشرق العربي): المؤتمر الرابع لمجمع اللغة العربية بدمشق، وعنوانه (اللغة العربية والمجتمع) : نوفمبر2005. ( نشر في سبع وأربعين صفحة)`,
  `(المتطلبات اللغوية لمعالجة التعابير الاصطلاحية العربية معالجة آلية)- المؤتمر السادس لهندسة اللغة- ديسمبر 2006. منشور في (مجلد الأوراق البحثية: ص337- 353 ).`,
  `(بعض مظاهر التغير في الاستعمال اللغوي الحديث للغة العربية): مؤتمر مجمع اللغة العربية القاهرة. د 73 2007`,
  `(فك لبس التعبير الاصطلاحي العربي آليا) (بحث مشترك):         Disambiguation of Idioms with special attention to Arabic   المؤتمر 7 لهندسة اللغة– الجمعية المصرية لهندسة اللغة- ديسمبر2007.`,
  `(معجم التعابير الاصطلاحية في العربية المعاصرة: عرض ونقد)- مؤتمر 7 لهندسة اللغة– ديسمبر 2007. `,
  `(معالجة المعاجم اللغوية العربية العامة للتجمعات اللفظية)- مجلة كلية الآداب، ج القاهرة- المجلد 68- يناير 2008.`,
  `(اللغة والانتماء القومى والهوية القومية)- مؤتمر 14 لتعريب العلوم- ج عين شمس- فبراير 2008.`,
  `(البنية الصرفية للفعل المجرد الصحيح بين الفصيحة والعامية المصرية): مؤتمر مجمع اللغة العربية بالقاهرة- أبريل 2008.`,
  `(الانحرافات اللغوية: اتجاهات في العربية المعاصرة) – المؤتمر التاسع للأدب المقارن، آداب القاهرة 2008. `,
  ` (التجديد في صناعة معاجم التجمعات اللفظية العربية): المؤتمر السابع لمجمع اللغة العربية بدمشق ، تشرين 2008.`,
  `(المعاجم القطاعية بين التراث والمعاصرة: معجم التعابير الاصطلاحية نموذجا)- الجامعة الإسلامية العالمية بماليزيا- 2011.`,
  `Arabic-English code-switching: variables of work and education.     ( التحول الشفري بين العربية والانجليزية: متغيرا العمل والتعليم ).  مؤتمر علم اللغة الاجتماعي 19- جامعة برلين الحرة 2012.`,
  `( دراسة مقارنة للمعايير والعلامات المستخدمة في معجمين أحاديي اللغة: روبير الصغير والمعجم العربي الأساسي):   ĖTUDE COMPARÉE DES NORMES ET DES MARQUES D'USAGE DANS DEUX DICTIONNAIRES MONOLINGUES : LE PETIT ROBERT ET AL ͨ ARABÎ ALASÀSÎ  (بحث مشترك)- كلية آداب القاهرة 2012.`,
  `(أثر أصوات الفعل الثلاثي المضعف في بنيته الصرفية: دراسة في الأصوات الشفهية) : مجلة (العربية) al-Arabiyya المجلد 46- مطبعة جامعة جورج تاون- الولايات المتحدة الأمريكية 2013.`,
  `(نحو بناء معجم عربي انجليزي آلي مقروء باستخدام الأنحاء ذات التعبير التحليلي الإعرابي) (بحث مشترك): 
   Towards Structuring an Arabic-English Machine-Readable Dictionary through Parsing Expression Grammar-    International Journal of Computational Linguistics Research, Digital Information Research  Foundation (USA, UK and India). .مارس 2014`,
  ` (معالجة المحتوى المعجمي الدلالي في المعجم العربي الحاسوبي: مقاربة لغوية حاسوبية)، (بحث مشترك)- مجلة هندسة اللغة- أبريل 2014. `,
  `(ترميز الظواهر الدلالية في المعجم الحاسوبي العربي)، (بحث مشترك)- مجلة هندسة اللغة- العدد (1)- المجلد (2)- سبتمبر 2014. `,
  `(استخلاص المعرفة من معجم آلي عربي- انجليزي مقروء باستخدام مستخلص معلوماتي مبني على قانون(، (بحث مشترك) الندوة الدولية 5 حول المعالجة الآلية للغة العربية- وجدة- المملكة المغربية- نوفمبر 2014.
Extracting Knowledge from an Arabic-English Machine-Readable Dictionary using Rule-based Information Extraction. `,
  ` (حال اللغة العربية ووسائل النهوض بها): المؤتمر الدولي للغة العربية– دبي- الإمارات العربية 2015.`,
  `Automatic Part-of-Speech Tagging of Arabic-English Dictionary Senses through Word Net   (بحث مشترك) -  researchgate.net – 2015.`,
  `(معالجة المحتوى المعجمي الدلالي في المعجم العربي الحاسوبي: مقاربة لغوية حاسوبية) (بحث مشترك) : 
 1, large corpora   invited paper- مؤتمر 8 لهندسة اللغة 2008. (مجلد الأوراق البحثية : ص1 – 30 )، نشر في مجلة هندسة اللغة- أبريل 2014.`,
  ` (أثر تجاور صوتي الفعل الثلاثي المضعف فى بابه الصرفي: دراسة في حيزي الحلق والشفتين)- مؤتمر مجمع القاهرة 2009.`,
  `(المعجم الحاسوبي العربي)- بحث عرض في ندوة بدار الكتب والوثائق القومية، ديسمبر 2009.`,
  `(المعجمية العربية الحاسوبية)- invited paper 3, Large corpora المؤتمر التاسع  لهندسة اللغة، جمعية هندسة اللغة، ديسمبر 2009.  ( مجلد الأوراق البحثية  ص 77-98 ). `,
  `(أثر تجـاور صـوتي الفعـل الثلاثي المـضعـف فى بابه الصـرفي: دراسة في الأحـياز الوسـطـية)- مؤتمر مجمع القاهرة 2010.`,
  `(شهادة حية لتجربة إصدار معجم التعابير الاصطلاحية في العربية المعاصرة)- المجلس الأعلى للثقافة بالقاهرة، أبريل 2010.`,
  `(أثر تجاور صوتي الفعل الثلاثي المضعف فى بابه الصرفي: دراسة في حيز الشفتين)- مؤتمر مجمع اللغة بالقاهرة- 2011.`,
  `( لسانيات النص)– بحث منشور في كتاب (دراسات أدبية ولغوية)- مكتبة الخانجي- القاهرة، ط1، 2011 .`,
  `(أثر تجاور صـوتي الفعـل الثلاثي المضعـف في بابه الصرفي: دراسة لغـوية حاسـوبية للأصـوات الذلقية) : مؤتمر هندسة اللغة 2011. invited paper 3, Computational linguistics    ، (مجلد الأوراق البحثية: ص198– 208).`,
  `Arabic-English code-switching: variables of work and education.  (التحول الشفري بين العربية والانجليزية: متغيرا العمل والتعليم)-(بحث مشترك)- مؤتمر علم اللغة الاجتماعي 19، جامعة برلين الحرة- أغسطس 2012.`,
  `(صورة المرأة في العـقـل الجمعي المصري من خلال أمثاله): المـوسم الثـقـافي 12 لمركز تحـقـيق التـراث: نوفمبر 2012.`,
  `(أثر الصرف في بناء المعجم الحاسوبي العربي)- (بحث مشترك) : المؤتمر 12 لهندسة اللغة، ديسمبر 2012 . (مجلد الأوراق البحثية: ص198– 208).`,
  `(القواعد الحاكمة لتنافر صوتي الفعل الثلاثي المضعف): مجلة جسور- ع 2- الأكاديمية الحديثة  للكتاب الجامعي 2013.`,
  `(أحكام تنافر صوتي الفعل الثلاثي المضاعف: دراسة لغوية حاسوبية) invited paper 2, Large corpora – المؤتمر13 لهندسة اللغة- ديسمبر2013. (مجلد الأوراق البحثية: ص120- 146.`,
  `(اللغة العربية والهوية القومية): بحث في الاحتفال بيوم اللغة العربية بالمجلس الأعلى للثقافة، القاهرة 16/ 12/ 2013.`,
  `(أثر الفاء الحلقي للفعل الثلاثي المضعف على الباب الصرفي لمضارعه)- مؤتمر مجمع اللغة بالقاهرة- الدورة 80- 2014.`,
  `(لافتات الشارع التجاري في المشرق العربي بين العربية والتغريب): مؤتمر مجمع العربية بالقاهرة- مارس 2014.`,
  ` (أثر الفـاء الحـلــقي للـفـعــل الثلاثي المـضعـف على البنية الصرفــية لمــضارعه: دراسة لغــوية حاســوبــيـة) invited paper  مؤتمر هندسة اللغة 2014 (مجلد الأوراق البحثية ص 124 -127 ، وفي كتيب الملخصات ص 9 ، ص 11).`,
  `(بعض مصطلحات علم اللغة الاجتماعي)- مؤتمر مجمع اللغة العربية بالقاهرة- الدورة 81-  مارس2015.`,
  `( حال اللغة العربية ووسائل النهوض بها)– مؤتمر (نحو عالمية اللغة العربية)- آداب القاهرة- 2015. `,
  `(المصطلح العلمي بين الواقع والتوحيد)– مؤتمر مجمع اللغة العربية بالقاهرة- الدورة 81، مارس 2015.`,
  `(أثر العين الحلقي للفعل الثلاثي المضعف على الباب الصرفي لمضارعه)- مؤتمر مجمع القاهرة- الدورة 82- مارس 2016.`,
  `(عربيتنا والتشبث بالبقاء) : بحث ألقي بمكتبة الإسكندرية في اليوم العالمي للغة العربية- ديسمبر 2016.`,
  `(أثر العين الحلقي للفعل الثلاثي المضعف على الباب الصرفي لمضارعه: دراسة لغوية حاسوبية): مؤتمر هندسة اللغة 2016. invited paper 1. Computational Linguistics ( مجلد الأوراق البحثية ص 1- 30 ).`,
  ` ( اللغة العربية وتكنولوجيا المعلومات)- الموسم الثقافي لمجمع اللغة العربية بالقاهرة- فبراير 2018.`,
  `(تحرير العـلاقة بين الفعـل الثلاثي الصحيح والمضارع المفـتوح العـين: دراسة استقـصائية في القاموس المحيط): مؤتمر مجمع اللغة العربية بالقاهرة- الدورة 84- أبريل 2018.`,
  `(لغتنا العربية والتكنولوجيا) Arabic language technologies  invited paper 2, : المؤتمر18- الجمعية المصرية لهندسة اللغة- ديسمبر 2018. ( مجلد الأوراق البحثية ص 3- 13 ).`,
  `(تعزيز اللغة العربية وتفاعلها مع التقنيات الحديثة) ندوة المائدة المستديرة: مؤتمر مجمع اللغة بالقاهرة- مارس 2019. مجلة مجمع اللغة العربية- العدد 174 ، الصفحات 121- 125.`,
  `(معا نتكامل لتعزيز لغتنا العربية): بحث ألقي في احتفال الملحقية الثقافية لسفارة المملكة العربية السعودية ومركز الملك عبد الله  بن عبد العزيز الدولي لخدمة اللغة العربية باليوم العالمي للغة العربية- 19 ديسمبر 2019.`,
  `(الحاسوب ومعالجة التعابير الاصطلاحية العربية): احتفالية معهد المخطوطات العربية بالقاهرة بيوم اللغة العربية ديسمبر 2019. https://youtu.be/3jfheTfEsNQ`,
  `(المعجم ونظم المعالجة الآلية) invited paper 2, : مؤتمر هندسة اللغة 2020. ( ملخصات 2019 : ص5 ). [ عقد المؤتمر بمكتبة الاسكندرية في أكتوبر 2020 ].`,
  `بناء برنامج حاسوبي عنوانه: (تحديد الباب الصرفي للفعل الثلاثي المضعف)- حاصل على شهادة إيداع وتسجيل مصنف حاسب آلي، من مكتب حماية حقوق الملكية الفكرية، التابع لوزارة الاتصالات وتكنولوجيا المعلومات. رقم الإيداع / التسجيل: 3902 ، بتاريخ 27 سبتمبر 2021.`,
  `من تطبيقات الذكاء الاصطناعي في خدمة اللغة العربية: برنامج حاسوبي يحدد الأبواب الصرفية للفعل الثلاثي المضعف: ندوة تطبيقات الذكاء الاصطناعي في مجالات العلوم الاجتماعية والإنسانيات – كلية الآداب، جامعة القاهرة – ديسمبر 2021.`,
  `(التجمعات اللفظية في المعاجم العربية الحديثة العامة: عرض ونقد)- بحث أقره مجلس مجمع اللغة العربية بالقاهرة- في الدورة 88- فبراير 2022.`,
  `(التحديات التي تواجه هوية اللغة العربية): الندوة العلمية الثانية بعنوان: (الهوية اللغوية العربية وتعزيز مكانتها)- مجمع الملك سلمان العالمي للغة العربية (علىFacebook & Twitter )- في الرابع من يونيو 2022.`,
  `( معا نتكامل لتعزيز هويتنا وتراثنا ولغتنا القومية): مجلة تراثيات، العدد الثاني والعشرون، شوال 1438- ذو الحجة 1443 ه/ يوليو2017- يوليو 2022 م القاهرة، دار الكتب والوثائق القومية- مركز تحقيق التراث 1444 ه- 2023 م`,
  `( بناء أول برنامج حاسوبي في اللغة العربية يحدد الباب الصرفي للفعل الثلاثي المضعف: دراسة لغوية حاسوبية مبنية على مدوَّنة) : invited paper  (بحث مدعو ) ألقي في المؤتمر العشرين لهندسة اللغة ، بتاريخ 12 أكتوبر 2022.`,
  `( هويتنا بين لغتنا وثقافتنا ): كلية الآداب، بجامعة القاهرة، بتاريخ 18 ديسمبر2022 ( في الاحتفال بيوم اللغة العربية) . `,
  `( لغتنا العربية بين الفصيحة والعامية): بحث ألقي بتاريخ  11 يناير 2023 ، في ندوة مجلة الأزهر، وعنوانها : ( من جهود مجلة الأزهر في النهوض باللغة العربية ودعم الهوية الوطنية ). وقد نشرت مقتطفات منه في مجلة الأزهر- ج 7- السنة 96 -(رجب 1444هـ- فبراير 2023 م).`,
  ` (بنية الفعل الثلاثي بين الفصيحة والعامية في الأمثال والتعابير الاصطلاحية المعاصرة): بحث عرض في مؤتمر مجمع اللغة العربية بالقاهرة – في دورته التاسعة والثمانين، بتاريخ 20 مايو 2023.`,
  `بناء برنامج حاسوبي عنوانه: ( أحكام تنافر صوتي الفعل الثلاثي المضعف )- حاصل على شهادة إيداع وتسجيل مصنف حاسب آلي، من مكتب حماية حقوق الملكية الفكرية، التابع لوزارة الاتصالات وتكنولوجيا المعلومات. رقم الإيداع / التسجيل: 4341 ، بتاريخ 30 يوليو 2023 .`,
  `بناء برنامج حاسوبي عنوانه: ( أحكام تآلف صوتي الفعل الثلاثي المضعف )- حاصل على شهادة إيداع وتسجيل مصنف حاسب آلي، من مكتب حماية حقوق الملكية الفكرية، التابع لوزارة الاتصالات وتكنولوجيا المعلومات. رقم الإيداع / التسجيل: 4369 ، بتاريخ 10 سبتمبر 2023.`,
  `Developing a Computational Linguistic Software for Accurate Analysis of Arabic            
  Trilateral Abstract Geminate Verbs Morphology Using Corpus- based Methods.
 باوربوينت عُرِضَ على مؤتمر قسم اللغة العربية ودراسات الترجمة بالجامعة الأمريكية، في الشارقة، وعنوانه:
The Praxis of Digital Humanities: Expanding Horizons and Transforming Scholarship in
the Arabic/Islamic world Department of Arabic and Translation studies, American University
 of Sharjah  AUS.                                                                                      بتاريخ 6- 7 مارس 2024.
`,
  `( بناء برنامج حاسوبي في اللغة العربية يحدد الأبواب الصرفية للفعل الثلاثي المضعف المجرد: دراسة لغوية حاسوبية مبنية على مدوّنة): مجلة كلية الآداب جامعة القاهرة، المجلد (84) العدد (4)، أبريل 2024.`,
  ` (من البرامج الحاسوبية لتعليم اللغة العربية: إنشاء برنامج يحدد الأبواب الصرفية للفعل الثلاثي المضعف المجرد): عَـرض تقديمي، عُرِض على مؤتمر مجمع اللغة العربية بالقاهرة، في دورته التسعين، بتاريخ 23 أبريل 2024.`,
  ` ( البنية الصرفية بين الفصيحة وعامية القاهرة في التعابير الاصطلاحية والأمثال المكتوبة): بحث عُـرِض على مؤتمر مجمع اللغة العربية بالقاهرة – في دورته التسعين، بتاريخ 24 أبريل 2024.`,
  `A Computational Tool for Arabic Trilateral Abstract Geminate Verbs Morphology     
      Linguistic and Philosophical Investigations, ISSN: 1841-2394, e- ISSN:2471-0881,   Vol 23 (1), 2024 , pp. 756 – 779 .                            (بحث مشترك)                                
   
`,
  `(صورة المرأة في العقل الجمعي المصري من أمثاله خلال): مجلة التراث المصري- دار الكتب والوثائق القومية- الإدارة المركزية للمراكز العلمية- مركز تحقيق التراث – مطبعة دار الكتب والوثائق القومية بالقاهرة- 1446ه- 2024 م.`,
  `(البنية الصوتية والصرفية للهمزة والألف بين الفصيحة والعامية المصرية: دراسة تطبيقية على التعابير الاصطلاحية والأمثال العامية) : بحث عُـرِض على مؤتمر مجمع اللغة العربية بالقاهرة – في دورته الحادية والتسعين، عام 2025.`,
  ` شاركت في إعداد مادة (المعجم الحديث لمصطلحات الإعلام ووسائل الاتصال ) وتصنيفها وإصدار المعجم في صيف عام 2025، مع لجنة اللغة العربية في الإعلام بمجمع القاهرة ، بوصفها مقررة لهذه اللجنة.`,
]; // حسبي الله و نعم الوكيل

export default function Researches() {
  return (
    <>
      <div>
        <h1 className="text-4xl text-center text-[#235A93] my-10">
          البحوث المنشورة دوليا وعربيا ومحليا
        </h1>
        <div className="container mx-auto">
          <div className="space-y-3">
            {researches.map(function (item, index) {
              if (index < 11) {
                return (
                  <p className="text-xl" key={index}>
                    <span className="font-bold text-[#235A93]">
                      {index + 1} .{" "}
                    </span>
                    {item}
                  </p>
                );
              }
            })}
          </div>
        </div>
        <h1 className="text-4xl text-center text-[#235A93] my-10">
          بحوث قدمت إلى المجلس القومي للثقافة والفنون والآداب والإعلام بمصر:
        </h1>
        <div className="container mx-auto">
          <div className="space-y-3">
            {researches.map(function (item, index) {
              if (index >= 11) {
                return (
                  <p className="text-xl" key={index}>
                    <span className="font-bold text-[#235A93]">
                      {index + 1} .{" "}
                    </span>
                    {item}
                  </p>
                );
              }
            })}
          </div>
        </div>
      </div>
    </>
  );
}
