import React from "react";
import Title from "../_Components/Title/Title";
import AnimatedContent from "../_Components/ReactBits/AnimatedContent";
import Certificate from "./Certificate";

const certificates = [
  "أول عضوة تنتخب في مجمع اللغة العربية بالقاهرة عام 2014 ، بعد ثمانين عاما من بدء عمله، وهي العضوة الوحيدة حتى الآن.",
  "شهادة تقدير وميدالية الأستاذ المثالي من نادي أعضاء هيئة التدريس بجامعة القاهرة 2004.",
  "درع جامعة القاهرة وشهادة تقدير؛ لفوزها بجائزة الجامعة التشجيعية للعلوم الإنسانية 2004.",
  "شهادة تقدير من جامعة القاهرة؛ لإشرافها على أفضل رسالة ماجستير بالكلية لعام 2012 /2013.",
  "درع كلية الآداب ودرع جامعة القاهرة؛ لفوزها بجائزة الجامعة التقديرية للعلوم الإنسانية 2013.",
  "درع الجمعية المصرية لهندسة اللغة؛ عن البحوث المتميزة في مجال هندسة اللغة 2014.",
  "درع الملحقية الثقافية السعودية بالقاهرة ومركز الملك عبد الله بن عبد العزيز الدولي 2014.",
  "شكر وتقدير من قطاع الفنون التشكيلية بوزارة الثقافة؛ لمشاركتها في مركز رامتان الثقافي، في ندوة: (وفاء كامل أول امرأة على منصة الخالدين)، في 4/3/2015.",
  "درع وشهادة تقدير من قسم اللغة العربية وآدابها بجامعة طنطا، في اليوم العالمي للمرأة 2016.",
  "درع جامعة القاهرة لفوزها بجائزة الجامعة للتميز في مجال العلوم الإنسانية 2016.",
  "درع مجمع اللغة العربية بالقاهرة؛ لفوزها بجائزة الجامعة للتميز في العلوم الإنسانية 2017.",
  "درع (وزارة الثقافة (في احتفالية تكريم المرأة المصرية 2018؛ لفوزها بعضوية المجمع لأول مرة في تاريخه.",
  "تكريم وشهادة تقدير في عام 2023 من قسم اللغة العربية وكلية الآداب بجامعة القاهرة ؛ لبحوثها المتميزة .",
  "شكر وتقدير من جامعة سيناء في احتفالية الجامعة باليوم العالمي للغة العربية في ديسمبر 2024   ",
  "شكر وتقدير من منصة إديو كاريرز  EduCareers   لجهودها العلمية البارزة في خدمة العلم والتعليم ، والارتقاء باللغة العربية. فبراير 2025 .",
  "شكر وتقدير من كلية الآداب بجامعة القاهرة لبحوثها وبرامجها اللغوية الحاسوبية الرائدة. سبتمبر 2025.",
];

export default async function Awards() {
  const res = await fetch(`https://test.drwafaakamel.com/api/v1/categories/3`, {
    next: { revalidate: 600 },
  });

  if (!res.ok) {
    throw new Error("فشل في تحميل البيانات");
  }

  const { data } = await res.json();

  return (
    <div>
      <Title> التكريم وشهادات التقدير </Title>
      <AnimatedContent
        direction="horizontal"
        duration={1.2}
        initialOpacity={0.2}
        animateOpacity
      >
        <div className="container mx-auto p-2">
          <div className="imgs">
            <Certificate data={data} />
          </div>
          <div className="mt-5 text-xl font-bold space-y-2">
            {certificates.map((item, index) => (
              <p key={index}>
                <span className="ml-2 text-[#235a93]">
                  <i className="fas fa-certificate"></i>
                </span>
                {item}
              </p>
            ))}
          </div>
        </div>
      </AnimatedContent>
    </div>
  );
}
